#Калькулятор равного вкладывания бабла в обязательные платежи в зависимости от индивидуального дохода. 
a = input("Получил A: \n ")
b = input("Получил В: \n ")
a = int(a)
b = int(b)
c = input ("Сколько тратим: \n ")
c = int(c)
f = a + b
x = c / f
a = a * x
b = b * x
a = round(a,2)
b = round(b,2)
c = a+b
x = x*100
x = round(x,2)
x = str(x)
a = str(a)
b = str(b)
c = str(c)
print ("Скидываемся по " + x + "% \n")
print ("A вкладывает: \n " + a + " рублей\n")
print ("В вкладывает: \n " + b + " рублей\n")
print ("Набранная сумма: \n " + c + " рублей")


